# VA Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..VA Property
SymbolTypeId Class See Also
---
Symbol VA, indicating unit Volt amperes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId VA { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property VA As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ VA {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace